{
  "architectures": [
    "OpenAIPrivacyFilterForTokenClassification"
  ],
  "attention_bias": true,
  "attention_dropout": 0.0,
  "bos_token_id": null,
  "classifier_dropout": 0.0,
  "default_n_ctx": 128000,
  "dtype": "bfloat16",
  "eos_token_id": 199999,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 640,
  "id2label": {
    "0": "O",
    "1": "B-account_number",
    "2": "I-account_number",
    "3": "E-account_number",
    "4": "S-account_number",
    "5": "B-private_address",
    "6": "I-private_address",
    "7": "E-private_address",
    "8": "S-private_address",
    "9": "B-private_date",
    "10": "I-private_date",
    "11": "E-private_date",
    "12": "S-private_date",
    "13": "B-private_email",
    "14": "I-private_email",
    "15": "E-private_email",
    "16": "S-private_email",
    "17": "B-private_person",
    "18": "I-private_person",
    "19": "E-private_person",
    "20": "S-private_person",
    "21": "B-private_phone",
    "22": "I-private_phone",
    "23": "E-private_phone",
    "24": "S-private_phone",
    "25": "B-private_url",
    "26": "I-private_url",
    "27": "E-private_url",
    "28": "S-private_url",
    "29": "B-secret",
    "30": "I-secret",
    "31": "E-secret",
    "32": "S-secret"
  },
  "initial_context_length": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 640,
  "label2id": {
    "B-account_number": 1,
    "B-private_address": 5,
    "B-private_date": 9,
    "B-private_email": 13,
    "B-private_person": 17,
    "B-private_phone": 21,
    "B-private_url": 25,
    "B-secret": 29,
    "E-account_number": 3,
    "E-private_address": 7,
    "E-private_date": 11,
    "E-private_email": 15,
    "E-private_person": 19,
    "E-private_phone": 23,
    "E-private_url": 27,
    "E-secret": 31,
    "I-account_number": 2,
    "I-private_address": 6,
    "I-private_date": 10,
    "I-private_email": 14,
    "I-private_person": 18,
    "I-private_phone": 22,
    "I-private_url": 26,
    "I-secret": 30,
    "O": 0,
    "S-account_number": 4,
    "S-private_address": 8,
    "S-private_date": 12,
    "S-private_email": 16,
    "S-private_person": 20,
    "S-private_phone": 24,
    "S-private_url": 28,
    "S-secret": 32
  },
  "max_position_embeddings": 131072,
  "model_type": "openai_privacy_filter",
  "num_attention_heads": 14,
  "num_experts_per_tok": 4,
  "num_hidden_layers": 8,
  "num_key_value_heads": 2,
  "num_local_experts": 128,
  "output_router_logits": false,
  "pad_token_id": 199999,
  "rms_norm_eps": 1e-05,
  "rope_parameters": {
    "beta_fast": 32.0,
    "beta_slow": 1.0,
    "factor": 32.0,
    "original_max_position_embeddings": 4096,
    "rope_theta": 150000.0,
    "rope_type": "yarn",
    "truncate": false
  },
  "router_aux_loss_coef": 0.001,
  "sliding_window": 128,
  "tie_word_embeddings": false,
  "transformers.js_config": {
    "use_external_data_format": {
      "model": 1,
      "model.onnx": 3,
      "model_fp16.onnx": 2
    }
  },
  "transformers_version": "5.8.0.dev0",
  "use_cache": false,
  "vocab_size": 200064
}
